 # -- coding: -utf-8 --

print "Roosters", 100.0 - 25.0 * 3.0 % 4.0  # % 取余；/ 取整  97

print 3.0 + 2.0 + 1.0 - 5.0 + 4.0 % 2.0 - 1.0 % 4.0 + 6.0   # % 取余；/ 取整   7

print 4.0 / 2.0   
print 5.0 / 2.0
print 4.0 % 2.0
print 5.0 % 2.0  

#别想复杂了 1.0 / 4.0 = 1.0   因为 1.0÷4.0=0------1.0 所以取余是1.0注意取整的5.0 / 2.0 因为5.0是浮点数，计算结果也应该是浮点数。所以5.0 / 2.0 = 2.5.           &&&&&&&&&&&&&&  这里怎么才能直接在注释换行，而不占用行数？                                &&&&&&&&&&&&&&  即4行都属于 行数12而不占第13行？




4.0 % 2.0 #每段代码可以以数字开始（什么都不会显示），但是不能以中英文开始

#一行的起始位置放一个

23242425

#python
